[
   {
      "type": "video",
      "title": "Goat Format Noob Upsets Top25 Ranked Duelist!",
      "id": "bU5S7BsSMk8",
      "date": "2022-09-14"
   },
   {
      "type": "text",
      "title": "Deck Searching Improved",
      "date": "2022-09-13",
      "story": "Fixed a bug and improved deck searching. Both Thunder Dragon and Rescue Cat now shuffle correctly after their second search. I hope this will be the end to the search bug saga. Additionally, after clicking on a card and the Response? button, the chat will now say \"Response to [card name]?\" More updates coming soon.<br>Edit: This update now also includes a server message that tells you when a player is looking at a graveyard/banished/deck. The card Question has now also been added to the game.<br>Edit 2: So many updates! Different Dimension Capsule has been added to the game as well. It should work correctly."
   },
   {
      "type": "text",
      "title": "Bottom Cards Added",
      "date": "2022-09-11",
      "story": "As of now, cards that require you to put cards on the bottom of your deck (e.g. Good Goblin Housekeeping) can now be used. In addition, the server correctly prints messages when you move cards from your hand to your deck. Before there was an issue with it revealing those cards to your opponent. This update also includes a minor bug in the way that certain script buttons were displaying. I hope you guys enjoy! Lots of progress is being made, and we're getting closer and closer to open beta with each passing day."
   },
   {
      "type": "video",
      "title": "Cold Wave Monarchs: Goat Format's Unstoppable Menace",
      "id": "M2bbfes2-rI",
      "date": "2022-09-10"
   },
   {
      "type": "text",
      "title": "Checkout The New Wall!",
      "date": "2022-09-09",
      "story": "Checkout Goat Duels' new wall! It will now be used to post announcements (like this one) and YouTube videos (as you can see elsewhere on this page). In the future, other people will be able to post their own content as well. This is all still a work in progress, but hopefully you get the basic idea.<br>Do you have any suggestions on how to improve this page? Just message me on discord. As a beta tester, your feedback and support always means a lot to me. Play some games with each other and let me know if you run into any issues. Remember, I can't improve Goat Duels without your input. Thanks again, everyone."
   },
   {
      "type": "video",
      "title": "This Weird Chaos Deck Keeps Crushing Goat Format Tournaments",
      "id": "uO4TKq2K3Ic",
      "date": "2022-08-30"
   },
   {
      "type": "video",
      "title": "Golem Sentry Is Goat Format's Next Big Thing",
      "id": "ajZnqhmOobo",
      "date": "2022-07-26"
   },
   {
      "type": "video",
      "title": "Why Wing Blast is TAKING OVER Goat Format!",
      "id": "EXA6JNdoMFs",
      "date": "2021-10-25"
   },
   {
      "type": "video",
      "title": "Feeling Lucky? Try This Stein Gate OTK Goat Format Deck",
      "id": "Kvx4ptXH9AA",
      "date": "2021-08-23"
   },
   {
      "type": "video",
      "title": "Playing Angel Chaos in 2021 Goat Format",
      "id": "dWB5WM8Q1wg",
      "date": "2021-08-03"
   },
   {
      "type": "video",
      "title": "7th Ranked Punts Chaos Mirror!? (Goat Format Duel Review)",
      "id": "2yAQlp6YJ3I",
      "date": "2021-06-21"
   },
   {
      "type": "video",
      "title": "Stop Losing to Library FTK in Goat Format!",
      "id": "xwuBMx4Mca0",
      "date": "2021-06-17"
   }
]
